import math as 数学


print('''
测试多行数据，
''这是一个测试''
"用来测试多行数据"
''',"成功!")


class 测试用类:
    def __init__(自己,名字):
        自己. 高度 =0
        自己. 名字 =名字
    
    def 打印名字(自己):
        print(自己. 名字)
    
    def 自增高度(自己):
        自己. 高度 +=1
        自己.检查()
    
    def 检查(自己):
        if 自己. 高度 ==  3:
            print("超高了!")


def 自增(数字):
    return 数字 +1

def 测试用函数(参数1,参数2,参数3):
    甲 =0
    while 甲 <= 3:
        参数1 =自增(参数1)
        甲 =甲 +1
    return 数学.sqrt(参数1)+数学.sqrt(参数2)+\
        数学.sqrt(参数3)


def 主函数():
    实例 =测试用类("测试用名字")
    print(实例. 名字)
    for 甲 in range(0,5):
        实例.自增高度()
    print(测试用函数(1,2,3))


if __name__ ==  "__main__":
    #这是一个测试用注释
    主函数()
    幸运数字 =[7,6,5,4,3,2,1]
    不幸数字 =[10,20,30]
    for 甲 in range(0,5):
        输入数据 =int(input("这是一个测试,请输入数字:\n"))
        if 输入数据 in 幸运数字:
            print("你输入了幸运数字%s!"%输入数据)
        elif 输入数据 in 不幸数字:
            print("你输入了不幸数字%d!"%输入数据)
        else:
            print("你好,\
                世界" +" "+str(输入数据))
